src/Catalogs/КонтрольныеПроцедуры/КонтрольныеПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольныеПроцедуры</name>
  <owners>Catalog.ВидыКонтрольныхПроцедур</owners>
  <attributes>
    <name>Выполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пауза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивацияТолькоСлужебныхЗадачПриОтключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОСбое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОВосстановлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИнцидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗакрытиеИнцидента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительноеОповещение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОповещенияПриСбое</name>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/НастройкиКонтрольРегламентныхЗаданий/НастройкиКонтрольРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольРегламентныхЗаданий</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимаяДлительностьВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЗапускаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ТипыЗадачКонтрольРегламентныхЗаданий/ТипыЗадачКонтрольРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗадачКонтрольРегламентныхЗаданий</name>
  <predefined>
    <items>
      <name>КонтрольРегламентныхЗаданийНетСобытий</name>
      <description>Восстановить работоспособность регламентных заданий</description>
    </items>
    <items>
      <name>КонтрольРегламентныхЗаданийОшибка</name>
      <description>Исправить ошибки в работе регламентных заданий</description>
    </items>
    <items>
      <name>КонтрольРегламентныхЗаданийТаймаут</name>
      <description>Разобрать причины слишком большой длительности выполнения регламентных заданий</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещатьПриКаждомИнциденте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПериодОповещенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПриВыполнении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КонтрольныеПроцедуры/Forms/ФормаЭлементаКонтрольРегламентныхЗаданий/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИсторияВыполнения.Параметры.УстановитьЗначениеПараметра("КонтрольнаяПроцедура", Объект.Ссылка);
    ИсторияВыполнения.Параметры.УстановитьЗначениеПараметра("ОбъектКонтроля", Объект.ОбъектКонтроля);
    
    ЭтотОбъект.Справка = Общий.ТекстHTMLМакета(Объект.Владелец.ИмяБизнесПроцесса);
    
    ЗагрузитьНастройки();
    ЗаполнитьПараметрыИнцидентов();
        
    Если Объект.ОбъектКонтроля.ПлощадкаЭксплуатации.ПометкаУдаления ИЛИ Объект.ОбъектКонтроля.ПлощадкаЭксплуатации = Справочники.ПлощадкиЭксплуатации.Корзина() Тогда
        ЭтотОбъект.ТолькоПросмотр = Истина;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьДоступностьКомандУправления();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    НастройкаВыполнена = Истина;
    Сохранено = Истина;
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогЗапускаКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    ОписаниеОповещениеЗавершение = Новый ОписаниеОповещения("ОбработкаНачалоВыбораЗавершение", ЭтотОбъект, Элемент);
	ОбщийКлиент.ВыбратьФайл(ЭтотОбъект[Элемент.Имя], "1cestart.exe|1cestart.exe", ОписаниеОповещениеЗавершение);
    
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд_формы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
    
    ЭтотОбъект.Записать();
	ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
    ЭтотОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
    
    Объект.Выполнять = Истина;
    Объект.Пауза = Ложь;
    УстановитьДоступностьКомандУправления();
    ЭтотОбъект.Записать();
    
КонецПроцедуры

&НаКлиенте
Процедура Пауза(Команда)
    
    Объект.Выполнять = Истина;
    Объект.Пауза = Истина;
    УстановитьДоступностьКомандУправления();
    ЭтотОбъект.Записать();
    
КонецПроцедуры

&НаКлиенте
Процедура Стоп(Команда)
    
    Объект.Выполнять = Ложь;
    Объект.Пауза = Ложь;
    УстановитьДоступностьКомандУправления();
    ЭтотОбъект.Записать();
    
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
    ВыполнитьСейчасНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
    
    ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект);
	РасписаниеКлиент.НастроитьРасписаниеПоложитьВоВременноеХранилище(ОписаниеОповещения);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ВыполнитьСейчасНаСервере(КонтрольнаяПроцедураСсылка)
    УправлениеЗаданиямиСервер.ЗапускКонтрольнойПроцедуры(КонтрольнаяПроцедураСсылка);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
    
    Настройки = Справочники.КонтрольныеПроцедуры.ПолучитьНастройкиКонтроляРегламентныхЗаданий(Объект.Ссылка);
    Если Настройки <> Неопределено Тогда
        ЭтотОбъект.КаталогЗапускаКлиента = Настройки.КаталогЗапускаКлиента;
        ЭтотОбъект.ДопустимаяДлительностьВыполнения = Настройки.ДопустимаяДлительностьВыполнения;
    КонецЕсли;
    
    РасписаниеПоУмолчанию = РасписаниеСервер.ПолучитьРасписание(Объект.Ссылка); 
	ЭтотОбъект.РасписаниеЗадания = РасписаниеПоУмолчанию;
	ЭтотОбъект.РасписаниеСтрока = Строка(РасписаниеПоУмолчанию);
	АдресВременногоХранилищаРасписания = ПоместитьВоВременноеХранилище(РасписаниеПоУмолчанию, ЭтотОбъект.УникальныйИдентификатор);
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
    
    МенеджерЗаписи = РегистрыСведений.НастройкиКонтрольРегламентныхЗаданий.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.КонтрольнаяПроцедура = Объект.Ссылка;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.ДопустимаяДлительностьВыполнения = ЭтотОбъект.ДопустимаяДлительностьВыполнения;
    МенеджерЗаписи.КаталогЗапускаКлиента = ЭтотОбъект.КаталогЗапускаКлиента;
    МенеджерЗаписи.Записать(Истина);
    
    РасписаниеСервер.СохранитьРасписание(ЭтотОбъект, Объект.Ссылка, ЭтотОбъект.АдресВременногоХранилищаРасписания);
    
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(Адрес, ДополнительныеПараметры) Экспорт
    
    Если Адрес <> Неопределено Тогда
		АдресВременногоХранилищаРасписания = Адрес;
    КонецЕсли;		
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандУправления()
    
    Если Объект.Выполнять = Ложь И Объект.Пауза = Ложь Тогда
        ЭтотОбъект.Элементы.Старт.Доступность = Истина;
        ЭтотОбъект.Элементы.Пауза.Доступность = Ложь;
        ЭтотОбъект.Элементы.Стоп.Доступность = Ложь;
    ИначеЕсли Объект.Выполнять = Истина И Объект.Пауза = Ложь Тогда
        ЭтотОбъект.Элементы.Старт.Доступность = Ложь;
        ЭтотОбъект.Элементы.Пауза.Доступность = Истина;
        ЭтотОбъект.Элементы.Стоп.Доступность = Истина;        
    ИначеЕсли Объект.Выполнять = Истина И Объект.Пауза = Истина Тогда
        ЭтотОбъект.Элементы.Старт.Доступность = Истина;
        ЭтотОбъект.Элементы.Пауза.Доступность = Ложь;
        ЭтотОбъект.Элементы.Стоп.Доступность = Истина;        
    КонецЕсли;
    
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИнцидентов()
    
    ПараметрыИнцидентаСтоп = Справочники.КонтрольныеПроцедуры.ПолучитьПараметрыИнцидентаКонтрольВыполненияРегламентныхЗаданий(Объект.Ссылка, Справочники.ТипыЗадачКонтрольРегламентныхЗаданий.КонтрольРегламентныхЗаданийНетСобытий);
	НовСтрока = ЭтотОбъект.ПараметрыИнцидентов.Добавить();
	НовСтрока.ТипИнцидента = ПараметрыИнцидентаСтоп.НаименованиеТипаИнцидента;
	НовСтрока.КодИнцидента = ПараметрыИнцидентаСтоп.КодИнцидента;
	
	ПараметрыИнцидентаТаймаут = Справочники.КонтрольныеПроцедуры.ПолучитьПараметрыИнцидентаКонтрольВыполненияРегламентныхЗаданий(Объект.Ссылка, Справочники.ТипыЗадачКонтрольРегламентныхЗаданий.КонтрольРегламентныхЗаданийТаймаут);
	НовСтрока = ЭтотОбъект.ПараметрыИнцидентов.Добавить();
	НовСтрока.ТипИнцидента = ПараметрыИнцидентаТаймаут.НаименованиеТипаИнцидента;
	НовСтрока.КодИнцидента = ПараметрыИнцидентаТаймаут.КодИнцидента;
    
    ПараметрыИнцидентаОшибка = Справочники.КонтрольныеПроцедуры.ПолучитьПараметрыИнцидентаКонтрольВыполненияРегламентныхЗаданий(Объект.Ссылка, Справочники.ТипыЗадачКонтрольРегламентныхЗаданий.КонтрольРегламентныхЗаданийОшибка);
	НовСтрока = ЭтотОбъект.ПараметрыИнцидентов.Добавить();
	НовСтрока.ТипИнцидента = ПараметрыИнцидентаОшибка.НаименованиеТипаИнцидента;
	НовСтрока.КодИнцидента = ПараметрыИнцидентаОшибка.КодИнцидента;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ЭтотОбъект[ДополнительныеПараметры.Имя] = ВыбранныеФайлы[0];
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
